# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 1 # number of classes
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  [
    [ -1, 1, MBV3Backbone, [True, 3] ],  # index 0

    [ 0, 1, TupleRoute, [0] ],           # index 1 → P3/8 (40ch)
    [ 0, 1, TupleRoute, [1] ],           # index 2 → P4/16 (112ch)
    [ 0, 1, TupleRoute, [2] ],           # index 3 → P5/32 (160ch)

    [ 1, 1, Conv, [256, 1, 1] ],         # index 4 → P3 adapted (256ch)
    [ 2, 1, Conv, [512, 1, 1] ],         # index 5 → P4 adapted (512ch)
    [ 3, 1, Conv, [1024, 1, 1] ],        # index 6 → P5 adapted (1024ch)

    [ 6, 1, SPPF, [1024, 5] ],           # index 7 → final backbone out
  ]

# YOLOv5 v6.0 head
head: [
  [-1, 1, Conv, [512, 1, 1]],                     #  8
  [-1, 1, nn.Upsample, [None, 2, "nearest"]],     #  9
  [[-1, 5], 1, Concat, [1]],                      # 10  concat with P4 adaptor (index 5), not 6
  [-1, 3, C3, [512, False]],                      # 11  P4 head

  [-1, 1, Conv, [256, 1, 1]],                     # 12
  [-1, 1, nn.Upsample, [None, 2, "nearest"]],     # 13
  [[-1, 4], 1, Concat, [1]],                      # 14  concat with P3 adaptor (index 4)
  [-1, 3, C3, [256, False]],                      # 15  P3 head

  [-1, 1, Conv, [256, 3, 2]],                     # 16  down to P4
  [[-1, 11], 1, Concat, [1]],                     # 17  concat with earlier P4 head (index 11), not 14
  [-1, 3, C3, [512, False]],                      # 18  P4 head (final)

  [-1, 1, Conv, [512, 3, 2]],                     # 19  down to P5
  [[-1, 8], 1, Concat, [1]],                      # 20  concat with pre-upsampling P5 (index 8)
  [-1, 3, C3, [1024, False]],                     # 21  P5 head (final)

  [[15, 18, 21], 1, Detect, [nc, anchors]],       # 22  Detect(P3,P4,P5) 
]