# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 80 # number of classes
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]], # 9
  ]

# YOLOv5 v6.0 head
head: [
    # top-down: P5 -> P4
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]],                 # cat backbone P4
    [-1, 3, C3Light, [512, False]],            # (light) replaces C3   [DSC #1]

    # top-down: P4 -> P3
    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]],                 # cat backbone P3
    [-1, 3, C3Light, [256, False]],            # (light) replaces C3   [DSC #2]

    # bottom-up: P3 -> P4 (stride-2 downsample 3x3)
    [-1, 1, DSConv, [256, 3, 2]],              # (light) replaces Conv [DSC #3]
    [[-1, 14], 1, Concat, [1]],                # cat head P4
    [-1, 3, C3Light, [512, False]],            # (light) replaces C3   [DSC #4]

    # bottom-up: P4 -> P5 (keep this downsample as regular Conv to keep total DSC=5)
    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 10], 1, Concat, [1]],                # cat head P5
    [-1, 3, C3Light, [1024, False]],           # (light) replaces C3   [DSC #5]

    [[17, 20, 23], 1, Detect, [nc, anchors]],
  ]