# YOLOv5 + MobileNetV3-Large backbone (YOSMR-style)

# Parameters
nc: 1 # number of classes (update as needed)
depth_multiple: 1.0
width_multiple: 1.0
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# Backbone
backbone: [
    [-1, 1, MBV3Backbone, []], # 0 backbone, returns (P3=40ch, P4=112ch, P5=960ch)
    [0, 1, Identity, [0]], # 1 -> P3
    [0, 1, Identity, [1]], # 2 -> P4
    [0, 1, Identity, [2]], # 3 -> P5
  ]

# Head
head: [
    # -------- P5 branch --------
    [3, 1, nn.Conv2d, [960, 512, 1, 1]], # P5 in=960 → 512
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 2], 1, Concat, [1]], # concat upsampled P5 with P4
    [-1, 3, C3, [512, False]], # → node 7

    # -------- P4 branch --------
    [2, 1, nn.Conv2d, [112, 256, 1, 1]], # P4 in=112 → 256
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 1], 1, Concat, [1]], # concat upsampled P4 with P3
    [-1, 3, C3, [256, False]], # → node 11

    # -------- Downsample P3->P4 --------
    [-1, 1, Conv, [256, 3, 2]], # stride=2
    [[-1, 7], 1, Concat, [1]], # concat with earlier P4 fusion
    [-1, 3, C3, [512, False]], # → node 14

    # -------- Downsample P4->P5 --------
    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 4], 1, Concat, [1]], # concat with P5 branch
    [-1, 3, C3, [1024, False]], # → node 17

    # -------- Detect --------
    [[11, 14, 17], 1, Detect, [nc, anchors]], # Detect(P3=256, P4=512, P5=1024)
  ]
