# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 1 # number of classes
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone: [
    [-1, 1, MBV3Backbone, [True, 3]], # index 0

    [0, 1, TupleRoute, [0]], # index 1 → P3/8 (40ch)
    [0, 1, TupleRoute, [1]], # index 2 → P4/16 (112ch)
    [0, 1, TupleRoute, [2]], # index 3 → P5/32 (160ch)

    [1, 1, Conv, [256, 1, 1]], # index 4 → P3 adapted (256ch)
    [2, 1, Conv, [512, 1, 1]], # index 5 → P4 adapted (512ch)
    [3, 1, Conv, [1024, 1, 1]], # index 6 → P5 adapted (1024ch)

    [-1, 1, SPP_yosmr, [1024, [1, 5, 9, 13]]], # index 7 → final backbone out
  ]

# YOLOv5 v6.0 head
head: [
    # top-down: P5 -> P4
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 5], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3Light, [512, False]], # (light) replaces C3   [DSC #1]

    # top-down: P4 -> P3
    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3Light, [256, False]], # (light) replaces C3   [DSC #2]

    # bottom-up: P3 -> P4
    [-1, 1, DSConv, [256, 3, 2]], # stride-2 downsample
    [[-1, 11], 1, Concat, [1]], # cat head P4 (was 14 → should be 11)
    [-1, 3, C3Light, [512, False]], # DSC #4

    # bottom-up: P4 -> P5
    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 8], 1, Concat, [1]], # cat head P5
    [-1, 3, C3Light, [1024, False]], # DSC #5

    [[15, 18, 21], 1, Detect, [nc, anchors]],
  ]
